<1>
	.flex_div{
		<1>-----------------------------------------------------------------------
		必写 , 声明此div是flex布局
		
		display : flex     
		width: 800px;      
		height: 600px;     
		
		<2>-----------------------------------------------------------------------
		主轴排列方向:水平布局或者垂直布局 
		
		flex-direction: row(默认值) | row-reverse | column | column-reverse;  
		
		<3>-----------------------------------------------------------------------
		items 在主轴方向上如何对齐
		
		justify-content : flex-start(默认值) | flex-end | center | space-between | space-around;
		
		<4>-----------------------------------------------------------------------
		items 在交叉轴轴上如何对齐
		
		align-items: flex-start | flex-end | center | baseline | stretch(默认值);
		
		<5>-----------------------------------------------------------------------
		是否换行
		 
		flex-wrap: nowrap(默认值) | wrap | wrap-reverse (第一行在下方,依然从左向右排列);
		
		<1>-----------------------------------------------------------------------
		 多根轴线的对齐方式 , 需要多根轴线才能生效 -->warp 
		 
		 align-content: flex-start | flex-end | center | space-between | space-around | stretch;
	}
	
/* *************************************************************************************************** */
flex：1代表什么意思
https://blog.csdn.net/aliven1/article/details/78853725

	.item{
		<1>-----------------------------------------------------------------------
		width和height
		
		<2>-----------------------------------------------------------------------
		order属性定义项目的排列顺序。数值越小，排列越靠前，默认为0。
		和其他item同名属性相比较的属性
		
		order: <integer>;
		
		<3>从这开始-----------------------------------------------------------------------		
		flex-grow属性定义项目的放大比例，默认为0，即如果存在剩余空间，也不放大。
		如果所有项目的flex-grow属性都为1，则它们将等分剩余空间（如果有的话）。
		如果一个项目的flex-grow属性为2，其他项目都为1，则前者占据的剩余空间将比其他项多一倍。
		和其他item同名属性相比较的属性
		
		flex-grow: <number>; /* default 0 不放大   非0 放大*/
		
		<4>-----------------------------------------------------------------------		
		flex-shrink属性定义了项目的缩小比例，默认为1，即如果空间不足，该项目将缩小。
		如果所有项目的flex-shrink属性都为1，当空间不足时，都将等比例缩小。
		如果一个项目的flex-shrink属性为0，其他项目都为1，则空间不足时，前者不缩小。
		和其他item同名属性相比较的属性

		
		flex-shrink: <number>; /* default 1 缩小   0 不缩小*/
		
		<5>-----------------------------------------------------------------------	
		flex-basis属性定义了在分配多余空间(flex-grow)之前，项目占据的主轴空间（main size）。
		
		flex-basis: <length> | auto(项目的本来大小); /* default auto */
		
		<6>-----------------------------------------------------------------------	
		align-self属性允许单个项目有与其他项目不一样的对齐方式，可覆盖align-items属性。
		默认值为auto，表示继承父元素的align-items属性，如果没有父元素，则等同于stretch。 
		
		align-self: auto | flex-start | flex-end | center | baseline | stretch;
	}